examples/store-api/app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("category_id", "code", "created_at", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["category_id", 2], ["code", "hic"], ["created_at", "2014-12-05 17:20:08.196062"], ["name", "enim"], ["price", 63.66], ["updated_at", "2014-12-05 17:20:08.196062"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "name" = ?, "updated_at" = ? WHERE "products"."id" = 4  [["name", "Gato de Leandro"], ["updated_at", "2014-12-05 16:17:23.516535"]]